-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Host: db
-- Generation Time: Apr 02, 2026 at 12:31 PM
-- Server version: 10.6.25-MariaDB-ubu2204
-- PHP Version: 8.3.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `skjacth_tablebooking`
--

-- --------------------------------------------------------

--
-- Table structure for table `bookings`
--

CREATE TABLE `bookings` (
  `id` int(11) NOT NULL,
  `TableID` varchar(10) NOT NULL,
  `name` varchar(255) NOT NULL,
  `lastName` varchar(255) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `batch` varchar(255) DEFAULT NULL,
  `gradYear` int(11) DEFAULT NULL,
  `payment_amount` decimal(10,2) DEFAULT NULL,
  `slip_path` varchar(255) DEFAULT NULL,
  `transfer_date` date DEFAULT NULL,
  `transfer_time` time DEFAULT NULL,
  `status` varchar(50) DEFAULT 'pending',
  `approved_by_admin_id` int(11) DEFAULT NULL,
  `approved_by` varchar(20) NOT NULL,
  `approved_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `bookings`
--

INSERT INTO `bookings` (`id`, `TableID`, `name`, `lastName`, `phone`, `batch`, `gradYear`, `payment_amount`, `slip_path`, `transfer_date`, `transfer_time`, `status`, `approved_by_admin_id`, `approved_by`, `approved_at`, `created_at`) VALUES
(8, 'K1', 'โต๊ะประธาน', '1', '00000000', '-', 1, 3600.00, 'slip_68c4f176038d4.jpeg', '2025-09-13', '11:21:00', 'pending', NULL, '', '2025-09-13 04:22:14', '2025-09-13 04:22:14'),
(9, 'K2', 'โต๊ะประธาน ', '2', '000000000000', '0', 1, 3600.00, 'slip_68c4f44539e55.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:34:13', '2025-09-13 04:34:13'),
(10, 'J1', 'ครูเก่า', '.', '2', '1', 1, 3600.00, 'slip_68c4f4de9c043.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:36:46', '2025-09-13 04:36:46'),
(11, 'J2', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f4fc0dcdb.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:37:16', '2025-09-13 04:37:16'),
(12, 'J3', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f51908632.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:37:45', '2025-09-13 04:37:45'),
(13, 'J4', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f53573686.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:38:13', '2025-09-13 04:38:13'),
(14, 'J5', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f5493ce3a.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:38:33', '2025-09-13 04:38:33'),
(15, 'J6', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f55faba32.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:38:55', '2025-09-13 04:38:55'),
(16, 'J10', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f575a3e81.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:39:17', '2025-09-13 04:39:17'),
(17, 'J9', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f58996035.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:39:37', '2025-09-13 04:39:37'),
(18, 'J8', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f59f8790b.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:39:59', '2025-09-13 04:39:59'),
(19, 'J7', 'ครูเก่า', '1', '1', '1', 1, 3600.00, 'slip_68c4f5b35d5e7.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 04:40:19', '2025-09-13 04:40:19'),
(20, 'L1', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4f657d58f1.jpg', '2025-09-11', '11:10:00', 'verified', 1, '', '2025-09-23 10:26:38', '2025-09-13 04:43:03'),
(21, 'L2', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4f68caa67b.jpg', '2025-09-11', '11:10:00', 'verified', 1, '', '2025-10-03 12:00:10', '2025-09-13 04:43:56'),
(22, 'L3', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4f7599bbc4.jpg', '2025-09-11', '11:10:00', 'verified', 1, '', '2025-10-03 12:01:49', '2025-09-13 04:47:21'),
(23, 'L4', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4ff3abab2d.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:20:58', '2025-09-13 05:20:58'),
(24, 'L5', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4ff60c3e0e.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:21:36', '2025-09-13 05:21:36'),
(25, 'L6', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4ff7f2db79.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:22:07', '2025-09-13 05:22:07'),
(26, 'L7', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4ff99d0ee3.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:22:33', '2025-09-13 05:22:33'),
(27, 'L8', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4ffbcb909c.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:23:08', '2025-09-13 05:23:08'),
(28, 'L9', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4ffd81c68e.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:23:36', '2025-09-13 05:23:36'),
(29, 'L10', 'ครูสวน', 'ผอ.เหว่ารับผิดชอบ', '0925539878', '1', 1, 3600.00, 'slip_68c4fff772928.jpg', '2025-09-11', '11:10:00', 'pending', NULL, '', '2025-09-13 05:24:07', '2025-09-13 05:24:07'),
(30, 'O1', 'ธนวันต์', 'ภักดีวัน', '0984192596', '-', 2569, 3600.00, 'slip_68c501a87b56a.jpeg', '2025-09-13', '12:30:00', 'verified', 1, '', '2025-09-13 05:47:55', '2025-09-13 05:31:20'),
(31, 'N6', 'ปานิสรา ', 'เรืองสอน', '0894907525', 'จ.ว. 28', 2529, 3600.00, 'slip_68c5051a038cf.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:08:43', '2025-09-13 05:46:02'),
(32, 'O6', 'ปาณิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c5061379082.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:08:37', '2025-09-13 05:50:11'),
(33, 'P6', 'ปานิสรา', 'เรืองสอน', '0894901525', 'จ.ว.28', 2529, 3600.00, 'slip_68c50895ac6c0.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:07:54', '2025-09-13 06:00:53'),
(34, 'H1', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c5089d01999.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:01:01', '2025-09-13 06:01:01'),
(35, 'I1', 'วิริยับัณฑิต', '1', '0818884564', '-', 1, 3600.00, 'slip_68c508c20c868.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:01:38', '2025-09-13 06:01:38'),
(36, 'G5', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c508f756255.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-15 03:47:13', '2025-09-13 06:02:31'),
(37, 'Q6', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c5091967817.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:07:44', '2025-09-13 06:03:05'),
(38, 'G10', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50928581dc.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-15 03:48:02', '2025-09-13 06:03:20'),
(39, 'R6', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2539, 3600.00, 'slip_68c5098d88ba6.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:07:01', '2025-09-13 06:05:01'),
(40, 'N7', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c509f9aa922.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:06:12', '2025-09-13 06:06:49'),
(41, 'O7', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c50a765a28c.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:05:50', '2025-09-13 06:08:54'),
(42, 'P7', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c50adf1dff1.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:05:38', '2025-09-13 06:10:39'),
(43, 'Q7', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c50b45a80b6.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:05:32', '2025-09-13 06:12:21'),
(44, 'R7', 'ปานิสรา', 'เรืองสอน', '0894907525', 'จ.ว.28', 2529, 3600.00, 'slip_68c50bac2b2e3.jpg', '2025-09-13', '12:44:00', 'verified', 1, '', '2025-09-19 14:05:25', '2025-09-13 06:14:04'),
(45, 'G9', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50c31c3a9d.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-15 03:47:56', '2025-09-13 06:16:17'),
(46, 'I2', 'วิริยับัณฑิต', '1', '0818884564', '-', 1, 3600.00, 'slip_68c50c5183578.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:16:49', '2025-09-13 06:16:49'),
(47, 'H2', 'วิริยับัณฑิต', '1', '0818884564', '-', 1, 3600.00, 'slip_68c50c7b294e1.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:17:31', '2025-09-13 06:17:31'),
(48, 'H3', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50ca545068.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:18:13', '2025-09-13 06:18:13'),
(49, 'I3', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50e5a907ca.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:25:30', '2025-09-13 06:25:30'),
(50, 'H4', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50e76b901b.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:25:58', '2025-09-13 06:25:58'),
(51, 'I4', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50e959c75a.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-13 06:26:29', '2025-09-13 06:26:29'),
(52, 'G4', 'วิริยับัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50ebac7560.jpeg', '2025-09-13', '13:00:00', 'pending', NULL, '', '2025-09-15 03:47:07', '2025-09-13 06:27:06'),
(53, 'I5', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50fac45407.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-13 06:31:08', '2025-09-13 06:31:08'),
(54, 'H5', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50fd403439.jpg', '2025-09-13', '13:31:00', 'pending', NULL, '', '2025-09-13 06:31:48', '2025-09-13 06:31:48'),
(55, 'I6', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50fd6ac4a5.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-13 06:31:50', '2025-09-13 06:31:50'),
(56, 'I7', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c50ff79e6e8.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-13 06:32:23', '2025-09-13 06:32:23'),
(57, 'H6', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c51000509d1.jpg', '2025-09-13', '13:31:00', 'pending', NULL, '', '2025-09-13 06:32:32', '2025-09-13 06:32:32'),
(58, 'H7', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510212fd2a.jpg', '2025-09-13', '13:31:00', 'pending', NULL, '', '2025-09-13 06:33:05', '2025-09-13 06:33:05'),
(59, 'I8', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510254c976.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-13 06:33:09', '2025-09-13 06:33:09'),
(60, 'G3', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c5104241cb1.jpg', '2025-09-13', '13:31:00', 'pending', NULL, '', '2025-09-15 03:47:01', '2025-09-13 06:33:38'),
(61, 'I9', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c51062bd87a.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-13 06:34:10', '2025-09-13 06:34:10'),
(62, 'G2', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c51074554e8.jpg', '2025-09-13', '13:34:00', 'pending', NULL, '', '2025-09-15 03:46:54', '2025-09-13 06:34:28'),
(63, 'I10', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c5107ecfbda.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-13 06:34:38', '2025-09-13 06:34:38'),
(64, 'G1', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510907fdcf.jpg', '2025-09-13', '13:34:00', 'pending', NULL, '', '2025-09-15 03:46:33', '2025-09-13 06:34:56'),
(65, 'H10', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510a843ea3.jpg', '2025-09-13', '13:34:00', 'pending', NULL, '', '2025-09-13 06:35:20', '2025-09-13 06:35:20'),
(66, 'G6', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510b2b09a6.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-15 03:47:32', '2025-09-13 06:35:30'),
(67, 'H9', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510c2524fa.jpg', '2025-09-13', '13:34:00', 'pending', NULL, '', '2025-09-13 06:35:46', '2025-09-13 06:35:46'),
(68, 'G7', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510e141104.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-15 03:47:39', '2025-09-13 06:36:17'),
(69, 'H8', 'วิริยะบัณฑิต', '1', '0818884564', '1', 1, 3600.00, 'slip_68c510e6ece6b.jpg', '2025-09-13', '13:34:00', 'pending', NULL, '', '2025-09-13 06:36:22', '2025-09-13 06:36:22'),
(70, 'G8', 'วิริยะบัณฑิะ', '1', '0818884564', '1', 1, 3600.00, 'slip_68c511075242d.jpeg', '2025-09-13', '13:30:00', 'pending', NULL, '', '2025-09-15 03:47:46', '2025-09-13 06:36:55'),
(71, 'M1', 'ทนพญ.นรารัตน์ ทูพันดุง', 'ทูพันดุง', '+66857342376', '3609', 2559, 3600.00, 'slip_68c647d40d8c6.jpeg', '2025-09-14', '11:42:00', 'verified', 1, '', '2025-09-19 14:04:54', '2025-09-14 04:43:00'),
(72, 'E1', 'นายธนวัฒน์', 'ปรางค์โท้', '0631614179', '140 ปี จิรประวัติวรเดช', 2559, 3600.00, 'slip_68c66f978acb4.jpeg', '2025-09-14', '14:31:00', 'verified', 1, '', '2025-09-19 14:04:49', '2025-09-14 07:32:39'),
(73, 'F1', 'นายธนวัฒน์', 'ปรางค์โท้', '0631614179', '3710', 2559, 3600.00, 'slip_68c6bde3e445b.jpeg', '2025-09-14', '20:05:00', 'verified', 1, '', '2025-09-19 14:04:14', '2025-09-14 13:06:43'),
(74, 'R4', 'นพดล', 'แร่เพ็ชร', '0905651177', 'ช่าง 45', 2545, 3600.00, 'slip_68c7a00cb450d.jpeg', '2025-09-15', '12:08:00', 'verified', 1, '', '2025-09-19 14:04:07', '2025-09-15 05:11:40'),
(75, 'E2', 'นครินทร์', 'ไข่ม่วง', '0999100433', '-', 2560, 3600.00, 'slip_68c7dbe449e9d.jpeg', '2025-09-15', '16:26:00', 'verified', 1, '', '2025-09-19 14:03:59', '2025-09-15 09:27:00'),
(76, 'F2', 'นครินทร์', 'ไข่ม่วง', '0999100433', '-', 2560, 3600.00, 'slip_68c7dc3cde395.jpeg', '2025-09-15', '16:28:00', 'verified', 1, '', '2025-09-19 14:03:55', '2025-09-15 09:28:28'),
(77, 'K6', 'ยรรยงค์ นิ่มสำลี', 'นิ่มสำลี', '0868987947', '33', 33, 3600.00, 'slip_68c8d69de2e0e.jpg', '2025-09-16', '10:13:00', 'verified', 1, '', '2025-09-19 14:03:49', '2025-09-16 03:16:45'),
(78, 'K7', 'ยรรยงค์', 'นิ่มสำลี', '0868987947', '2533', 2533, 3600.00, 'slip_68ca6bbd26e6f.jpg', '2025-09-17', '15:00:00', 'verified', 1, '', '2025-09-19 14:03:44', '2025-09-17 08:05:17'),
(79, 'D6', 'นายพัชรพล', 'เพ็ชรากุล', '0918379724', 'ม.4/5 (2568)', 2570, 3600.00, 'slip_68d215457aea3.jpeg', '2025-09-23', '10:34:00', 'verified', 1, '', '2025-09-23 10:23:04', '2025-09-23 03:34:29'),
(80, 'P10', 'กิตติพงษ์', 'ทาหะพรหม', '0880185018', '', 2546, 3600.00, 'slip_68d480cb3e74b.jpeg', '2025-09-25', '06:36:00', 'verified', 1, '', '2025-09-25 10:10:10', '2025-09-24 23:37:47'),
(81, 'Q1', 'ผู้ปกครอง ม.5/4', 'ม.5/4', '0813635773', '', 2568, 3600.00, 'slip_68d4a5ed6c37b.jpeg', '2025-09-25', '09:14:00', 'verified', 1, '', '2025-09-25 10:21:32', '2025-09-25 02:16:13'),
(82, 'P1', 'ครูเฟรส ผปค5.5', 'ผู้ปกครอง 5.5', '0979759678', 'ผปค', 2568, 3600.00, 'slip_68d4a63fe36d5.jpeg', '2025-09-25', '09:12:00', 'verified', 1, '', '2025-09-25 10:21:14', '2025-09-25 02:17:35'),
(83, 'K4', 'นันทกานต์ จิรังกรณ์', 'จิรังกรณ์', '0806153954', '4619 ม.6)3', 2568, 3600.00, 'slip_68d4cfe1d12d9.jpg', '2025-09-25', '12:14:00', 'verified', 1, '', '2025-10-06 01:16:33', '2025-09-25 05:15:13'),
(84, 'K5', 'นันทกานต์', 'จิรังกรณ์', '0806153954', '4619 ม.6/3', 2568, 3600.00, 'slip_68d4d01ba71e4.jpg', '2025-09-25', '12:14:00', 'verified', 1, '', '2025-10-06 01:16:37', '2025-09-25 05:16:11'),
(85, 'K9', 'ธัญพิชชา', 'รสชะเอม', '0817190242', 'บ๊อบบี้', 2535, 3600.00, 'slip_68d5546ca48da.jpeg', '2025-09-25', '21:40:00', 'verified', 1, '', '2025-09-25 14:44:54', '2025-09-25 14:40:44'),
(86, 'O2', 'นางสาวภัคจิรา', 'เมฆาสวัสดิ์วงศ์ ม.1/5', '0898575575', '2570', 2570, 3600.00, 'slip_68d6306498639.jpg', '2025-09-26', '13:19:00', 'verified', 1, '', '2025-09-30 07:56:55', '2025-09-26 06:19:16'),
(87, 'R5', 'นายสัมฤทธ์', 'สาดจีนพงษ์', '0866794547', '1', 2518, 3600.00, 'slip_68db4641d219f.jpg', '2025-09-30', '09:53:00', 'verified', 1, '', '2025-09-30 07:43:52', '2025-09-30 02:53:53'),
(88, 'F6', 'ครูนงนุช', 'บุรุษพัฒน์', '0931315735', '1/2', 2570, 3600.00, 'slip_68dd022635db1.jpeg', '2025-10-01', '17:27:00', 'verified', 1, '', '2025-10-01 12:36:05', '2025-10-01 10:27:50'),
(89, 'M2', 'นางณัฏฐิกานต์', 'แสงอุทัย', '0921899145', '5/3', 2569, 3600.00, 'slip_68df8bb37c5f5.jpeg', '2025-10-03', '15:39:00', 'verified', 1, '', '2025-10-03 11:58:27', '2025-10-03 08:39:15'),
(90, 'M10', 'บุญชรัสมิ์  (ธันวา )', 'ธรรมา', '0652652943', 'ช่อพันธุ์ทิพย 4', 2536, 3600.00, 'slip_68e09be454a08.jpg', '2025-10-04', '11:00:00', 'verified', 1, '', '2025-10-06 01:11:39', '2025-10-04 04:00:36'),
(91, 'R1', 'นายวีรชล', 'คุ้มอภัย', '0895295779', 'ชมพูพันธุ์ทิพย์ ช่อที่ 5', 2535, 3600.00, 'slip_68e0c6823b51a.jpeg', '2025-10-04', '13:58:00', 'verified', 1, '', '2025-10-04 10:02:57', '2025-10-04 07:02:26'),
(92, 'S1', 'นายวีรชล', 'คุ้มภัย', '0895295779', 'ชมพูพันธุ์ทิพย์ ช่อที่ 5', 2535, 3600.00, 'slip_68e0c6eb2c824.jpeg', '2025-10-04', '13:59:00', 'verified', 1, '', '2025-10-04 10:02:52', '2025-10-04 07:04:11'),
(94, 'N10', 'บุญชรัสมิ์  (ธันวา )', 'ธรรมา', '0652652943', 'ช่อพันธุ์ทิพย 4', 2536, 3600.00, '', NULL, NULL, 'pending', NULL, '', '2025-10-24 12:11:30', '2025-10-04 04:00:36'),
(95, 'T1', 'นายวีรชล', 'คุ้มภัย', '0895295779', 'ชมพูพันธุ์ทิพย์ ช่อที่ 5', 2535, 3600.00, '', NULL, NULL, 'verified', 1, '', '2025-10-24 12:01:57', '2025-10-04 07:04:11'),
(96, 'M9', 'อัครนันท์', 'ไตรทิพย์อนุรักษ์', '086-201-6387', '', 2536, 3600.00, 'slip_68e3dc25999f8.jpg', '2025-10-06', '22:10:00', 'verified', 1, '', '2025-10-07 10:13:31', '2025-10-06 15:11:33'),
(97, 'N9', 'อัครนันท์', 'ไตรทิพย์อนุรักษ์', '0862016387', '', 2536, 3600.00, 'slip_68e3dd24220c0.jpg', '2025-10-06', '22:14:00', 'verified', 1, '', '2025-10-07 10:13:28', '2025-10-06 15:15:48'),
(98, 'N2', 'นางสาวสิวารี', 'ใจมาดี', '0882828597', '2/4', 2569, 3600.00, 'slip_68e4aba4d511c.jpeg', '2025-10-07', '12:56:00', 'verified', 1, '', '2025-10-07 10:10:05', '2025-10-07 05:56:52'),
(99, 'K3', 'คุณครูเมตตา', 'เจริญโพธิ์', '0895681277', '4619 ปี2568', 2568, 3600.00, 'slip_68e636c703e2f.jpg', '2025-10-08', '16:28:00', 'verified', 1, '', '2025-10-13 14:34:31', '2025-10-08 10:02:47'),
(100, 'K11', 'กิติพัฒน์ ยอดทอง', 'ยอดทอง', '0852727572', '', 2568, 3600.00, 'slip_68e9f00d340b1.jpeg', '2025-10-11', '12:48:00', 'verified', 1, '', '2025-10-13 14:35:31', '2025-10-11 05:50:05'),
(101, 'L11', 'กิติพัฒน์ ', 'ยอดทอง', '0852727572', '-', 2568, 3600.00, 'slip_68e9f05c30ef3.jpeg', '2025-10-11', '12:51:00', 'verified', 1, '', '2025-10-13 14:35:33', '2025-10-11 05:51:24'),
(102, 'M11', 'กิติพัฒน์', 'ยอดทอง', '0852727572', '-', 2568, 3600.00, 'slip_68e9f0a6455d2.jpeg', '2025-10-11', '12:52:00', 'verified', 1, '', '2025-10-13 14:35:36', '2025-10-11 05:52:38'),
(103, 'M3', 'ร.ท.วสันต์', 'ทองพันชั่ง', '061-2599595', '-', 2568, 3600.00, '', NULL, NULL, 'pending', 1, '', '2025-10-14 04:55:01', '2025-10-14 05:52:38'),
(104, 'N3', 'ร.ท.วสันต์', 'ทองพันชั่ง', '061-2599595', '-', 2568, 3600.00, '', NULL, NULL, 'pending', 1, '', '2025-10-14 04:55:01', '2025-10-14 05:52:38'),
(105, 'O3', 'ร.ท.วสันต์', 'ทองพันชั่ง', '061-2599595', '-', 2568, 3600.00, '', NULL, NULL, 'pending', 1, '', '2025-10-14 04:55:01', '2025-10-14 05:52:38'),
(106, 'P3', 'ร.ท.วสันต์', 'ทองพันชั่ง', '061-2599595', '-', 2568, 3600.00, '', NULL, NULL, 'pending', 1, '', '2025-10-14 04:55:01', '2025-10-14 05:52:38'),
(107, 'N1', 'กันยารัตน์', 'นิลภา', '0925539878', 'ม.2/5', 2568, 3600.00, 'slip_68ef372e1142c.jpg', '2025-10-15', '12:54:00', 'verified', 1, '', '2025-10-15 06:15:35', '2025-10-15 05:54:54'),
(108, 'M4', 'จรัญญา', 'สนองคุณ', '0815326057', 'จว 21', 2522, 3600.00, 'slip_68f1b66a59ac3.jpeg', '2025-10-17', '10:21:00', 'verified', 1, '', '2025-10-18 13:04:37', '2025-10-17 03:22:18'),
(109, 'M5', 'จรัญญา', 'สนองคุณ', '0815326057', '23', 2522, 3600.00, 'slip_68f1b7aca5489.jpeg', '2025-10-17', '10:21:00', 'verified', 1, '', '2025-10-18 13:04:31', '2025-10-17 03:27:40'),
(110, 'N4', 'จรัญญา', 'สนองคุณ', '0815326057', '23', 2522, 3600.00, 'slip_68f1b7ed3ee15.jpeg', '2025-10-17', '10:21:00', 'verified', 1, '', '2025-10-18 13:04:25', '2025-10-17 03:28:45'),
(111, 'N5', 'จรัญญา', 'สนองคุณ', '0815326057', 'จว 21', 2522, 3600.00, 'slip_68f1b83c4bd5a.jpeg', '2025-10-17', '10:21:00', 'verified', 1, '', '2025-10-18 13:04:18', '2025-10-17 03:30:04'),
(112, 'J11', 'นายวิริยะ', 'บัณฑิต', '0818884564', NULL, NULL, 3600.00, NULL, NULL, NULL, 'pending', NULL, '', '2025-10-22 01:42:12', '2025-10-22 01:42:12'),
(113, 'J12', 'นายวิริยะ', 'บัณฑิต', '0818884564', NULL, NULL, 3600.00, NULL, NULL, NULL, 'pending', NULL, '', '2025-10-22 01:43:34', '2025-10-22 01:43:34'),
(114, 'J13', 'นายวิริยะ', 'บัณฑิต', '0818884564', NULL, NULL, 3600.00, NULL, NULL, NULL, 'pending', NULL, '', '2025-10-22 01:44:11', '2025-10-22 01:44:11'),
(115, 'I11', 'นายวิริยะ', 'บัณฑิต', '0818884564', NULL, NULL, 3600.00, NULL, NULL, NULL, 'pending', NULL, '', '2025-10-22 01:45:04', '2025-10-22 01:45:04'),
(116, 'I12', 'นายวิริยะ', 'บัณฑิต', '0818884564', NULL, NULL, 3600.00, NULL, NULL, NULL, 'pending', NULL, '', '2026-03-27 05:22:43', '2025-10-22 01:45:38'),
(117, 'K8', 'นายเสกสรรค์', 'ชังชั่ว', '0836249503', 'กองการศึกษาฯ', 2568, 3600.00, 'slip_68fadea457897.jpg', '2025-10-24', '09:02:00', 'verified', 1, '', '2025-10-24 11:58:28', '2025-10-24 02:04:20'),
(118, 'T2', 'สุวิมล555', 'แซ่เตียว', '0827718295', 'รุ่น 2568/5.1', 2569, 3600.00, 'slip_694cb1144da9c.jpg', '2025-12-25', '10:35:00', 'verified', 1, '', '2026-03-31 09:59:07', '2025-12-25 03:35:48');

-- --------------------------------------------------------

--
-- Table structure for table `system_settings`
--

CREATE TABLE `system_settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `system_settings`
--

INSERT INTO `system_settings` (`setting_key`, `setting_value`) VALUES
('booking_mode', 'closed'),
('current_event_year', '2026');

-- --------------------------------------------------------

--
-- Table structure for table `tb_admins`
--

CREATE TABLE `tb_admins` (
  `admin_id` int(11) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `admin_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tb_admins`
--

INSERT INTO `tb_admins` (`admin_id`, `username`, `password_hash`, `admin_name`) VALUES
(1, 'manit', '$2y$10$5QZWi27rh6zM/eLL1pkiMOs.Z/4yp/tRbfd95drq41wgxOASiUz5a', 'ครูมานิต');

-- --------------------------------------------------------

--
-- Table structure for table `tb_evaluations`
--

CREATE TABLE `tb_evaluations` (
  `id` int(11) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `lucky_code` varchar(6) DEFAULT NULL,
  `event_year` int(11) DEFAULT 2025,
  `enroll_year` varchar(50) DEFAULT NULL,
  `grad_level` varchar(100) DEFAULT NULL,
  `gender` varchar(50) DEFAULT NULL,
  `age_range` varchar(50) DEFAULT NULL,
  `grad_school` varchar(100) DEFAULT NULL,
  `user_status` varchar(255) DEFAULT NULL,
  `user_status_other` varchar(255) DEFAULT NULL,
  `occupation` varchar(255) DEFAULT NULL,
  `occupation_other` varchar(255) DEFAULT NULL,
  `info_source` varchar(255) DEFAULT NULL,
  `q1_1` tinyint(4) DEFAULT NULL,
  `q1_2` tinyint(4) DEFAULT NULL,
  `q1_3` tinyint(4) DEFAULT NULL,
  `q1_4` tinyint(4) DEFAULT NULL,
  `q1_5` tinyint(4) DEFAULT NULL,
  `q2_1` tinyint(4) DEFAULT NULL,
  `q2_2` tinyint(4) DEFAULT NULL,
  `q2_3` tinyint(4) DEFAULT NULL,
  `q2_4` tinyint(4) DEFAULT NULL,
  `q3_1` tinyint(4) DEFAULT NULL,
  `q3_2` tinyint(4) DEFAULT NULL,
  `q3_3` tinyint(4) DEFAULT NULL,
  `q3_4` tinyint(4) DEFAULT NULL,
  `q4_1` tinyint(4) DEFAULT NULL,
  `q4_2` tinyint(4) DEFAULT NULL,
  `q4_3` tinyint(4) DEFAULT NULL,
  `q4_4` tinyint(4) DEFAULT NULL,
  `q4_5` tinyint(4) DEFAULT NULL,
  `q5_1` tinyint(4) DEFAULT NULL,
  `q5_2` tinyint(4) DEFAULT NULL,
  `q5_3` tinyint(4) DEFAULT NULL,
  `q5_4` tinyint(4) DEFAULT NULL,
  `q6_1` tinyint(4) DEFAULT NULL,
  `q6_2` tinyint(4) DEFAULT NULL,
  `q6_3` tinyint(4) DEFAULT NULL,
  `comment_impress` text DEFAULT NULL,
  `comment_improve` text DEFAULT NULL,
  `comment_more` text DEFAULT NULL,
  `is_winner` tinyint(1) DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;

--
-- Dumping data for table `tb_evaluations`
--

INSERT INTO `tb_evaluations` (`id`, `full_name`, `phone`, `lucky_code`, `event_year`, `enroll_year`, `grad_level`, `gender`, `age_range`, `grad_school`, `user_status`, `user_status_other`, `occupation`, `occupation_other`, `info_source`, `q1_1`, `q1_2`, `q1_3`, `q1_4`, `q1_5`, `q2_1`, `q2_2`, `q2_3`, `q2_4`, `q3_1`, `q3_2`, `q3_3`, `q3_4`, `q4_1`, `q4_2`, `q4_3`, `q4_4`, `q4_5`, `q5_1`, `q5_2`, `q5_3`, `q5_4`, `q6_1`, `q6_2`, `q6_3`, `comment_impress`, `comment_improve`, `comment_more`, `is_winner`, `created_at`, `updated_at`) VALUES
(1, 'วชิรวิทยื', '0612599595', '733584', 2026, '2555', '2556', 'หญิง', '25-35 ปี', 'ส.ก.จ.', 'ศิษย์เก่า', '', 'รับราชการ', '', '', 1, 3, 3, 3, 4, 3, 4, 4, 4, 3, 3, 4, 4, 3, 3, 4, 2, 3, 3, 4, 3, 3, 3, 3, 3, '55', '55', '55', 0, '2026-03-31 10:22:13', '2026-03-31 10:24:01');

-- --------------------------------------------------------

--
-- Table structure for table `tb_tables_config`
--

CREATE TABLE `tb_tables_config` (
  `table_id` varchar(10) NOT NULL,
  `status` enum('available','blocked_visible','blocked_hidden') DEFAULT 'available',
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;

--
-- Dumping data for table `tb_tables_config`
--

INSERT INTO `tb_tables_config` (`table_id`, `status`, `updated_at`) VALUES
('A1', 'blocked_visible', '2026-03-27 03:30:29'),
('A2', 'blocked_visible', '2026-03-27 03:32:51'),
('A3', 'blocked_visible', '2026-03-27 03:32:52'),
('A4', 'blocked_visible', '2026-03-27 03:32:53'),
('A5', 'blocked_visible', '2026-03-27 03:32:54'),
('B2', 'blocked_hidden', '2026-03-27 03:32:57'),
('C3', 'blocked_hidden', '2026-03-27 03:32:59');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bookings`
--
ALTER TABLE `bookings`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_approved_by_admin` (`approved_by_admin_id`);

--
-- Indexes for table `system_settings`
--
ALTER TABLE `system_settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- Indexes for table `tb_admins`
--
ALTER TABLE `tb_admins`
  ADD PRIMARY KEY (`admin_id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `tb_evaluations`
--
ALTER TABLE `tb_evaluations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tb_tables_config`
--
ALTER TABLE `tb_tables_config`
  ADD PRIMARY KEY (`table_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bookings`
--
ALTER TABLE `bookings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=119;

--
-- AUTO_INCREMENT for table `tb_admins`
--
ALTER TABLE `tb_admins`
  MODIFY `admin_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tb_evaluations`
--
ALTER TABLE `tb_evaluations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `bookings`
--
ALTER TABLE `bookings`
  ADD CONSTRAINT `fk_approved_by_admin` FOREIGN KEY (`approved_by_admin_id`) REFERENCES `tb_admins` (`admin_id`) ON DELETE SET NULL ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
